---
kind: method
id: M:Autodesk.Revit.DB.ForgeTypeId.Empty
source: html/91ad316c-109c-7295-af34-c61d1bfaa2ec.htm
---
# Autodesk.Revit.DB.ForgeTypeId.Empty Method

Checks if the typeId is an empty string

## Syntax (C#)
```csharp
public bool Empty()
```